src/Расширение1/Catalogs/Конвертации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Конвертации</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередКонвертацией</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеКонвертации</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередОтложеннымЗаполнением</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Расширение1/Catalogs/Конвертации/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем КонсольКодаПередКонвертацией;

&НаКлиенте
Перем КонсольКодаПередОтложеннымЗаполнением;

&НаКлиенте
Перем КонсольКодаПослеКонвертации;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Элементы.АлгоритмПередКонвертацией.Видимость = Ложь;
	Элементы.АлгоритмПередОтложеннымЗаполнением.Видимость = Ложь;
	Элементы.АлгоритмПослеКонвертации.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	
	ПередКонвертациейHTML = АдресКонсолиКода;
	ПередОтложеннымЗаполнениемHTML = АдресКонсолиКода;
	ПослеКонвертацииHTML = АдресКонсолиКода;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	// Запишем новый текст в реквизиты.
	
	Объект.АлгоритмПередКонвертацией = КонсольКодаПередКонвертацией.getText();
	
	Объект.АлгоритмПередОтложеннымЗаполнением = КонсольКодаПередОтложеннымЗаполнением.getText();
	
	Объект.АлгоритмПослеКонвертации = КонсольКодаПослеКонвертации.getText();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Расш1_ПередКонвертациейHTMLДокументСформированПосле(Элемент)
	
	КонсольКодаПередКонвертацией = Элементы.ПередКонвертациейHTML.Документ.defaultView;
	ИнициализацияРедактора(КонсольКодаПередКонвертацией, Объект.АлгоритмПередКонвертацией);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередОтложеннымЗаполнениемHTMLДокументСформированПосле(Элемент)
	
	КонсольКодаПередОтложеннымЗаполнением = Элементы.ПередОтложеннымЗаполнениемHTML.Документ.defaultView;
	ИнициализацияРедактора(КонсольКодаПередОтложеннымЗаполнением, Объект.АлгоритмПередОтложеннымЗаполнением);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПослеКонвертацииHTMLДокументСформированПосле(Элемент)
	
	КонсольКодаПослеКонвертации = Элементы.ПослеКонвертацииHTML.Документ.defaultView;
	ИнициализацияРедактора(КонсольКодаПослеКонвертации, Объект.АлгоритмПослеКонвертации);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИнициализацияРедактора(ВнешнийОбъект, РеквизитОбъекта)
	
	Инфо = Новый СистемнаяИнформация();
	ВнешнийОбъект.init(Инфо.ВерсияПриложения);
	
	// Очистим элемент от предыдущих значений.
	ВнешнийОбъект.eraseText();
	// Прочитаем текст из реквизита.
	ВнешнийОбъект.setText(РеквизитОбъекта);
	
КонецПроцедуры

#КонецОбласти
